Revit 2027 API
FabricationPart.HasHandle Property
 Indicates whether fabrication part has a handle.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasHandle { get; }
Public ReadOnly Property HasHandle As Boolean
	Get
public:
property bool HasHandle {
	bool get ();
}
member HasHandle : bool with get
Property Value
Boolean
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace